[InferenceExplanation] Tom review changes.
